PuddingIndustries/AsunaFirmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash selection
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota.csv"

# Debug Console
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# FreeRTOS
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_WS_SUPPORT=y

# LwIP
CONFIG_LWIP_SO_LINGER=y

# UART Driver
CONFIG_UART_ISR_IN_IRAM=y